{
  "home": {
    "Home title": "Home title",
    "Home description": "Home description",
    "Header": "Scroll to see button"
  },
  "about": {
    "About title": "About titlee",
    "About description": "About description"
  },
  "header": {
    "Home": "Home",
    "About": "About"
  },
  "percentDiffCalc": {
    "title": "Percentage Difference Calculator",
    "description": "Find the percent difference between two positive numbers greater than 0. It is usually calculated when you want to know the difference in percentage between two numbers.",
    "note": "NOTE: Percent Difference is not the same like "
  },
  "btuToM3Converter": {
    "title": "BTU to M3 Converter",
    "description": "Discover the efficient way to convert energy units with our user-friendly BTU (British Thermal Unit) to cubic meter (m^3) converter. Whether you're in the realm of heating systems, gas appliances, or industrial processes, this tool provides instant and accurate conversions, allowing you to seamlessly switch between BTUs and cubic meters with ease. Simplify your calculations and streamline your projects with our intuitive online converter, accessible anytime and anywhere.",
    "btuToM3": "BTU to M3"
  },
  "btuToKwConverter": {
    "title": "BTU to KW Converter",
    "description": "To convert BTU (British Thermal Units) to kilowatts (kW), you can use the following conversion formula:\n\n 1 BTU/h = 0.00029307107 kW\n\nThis conversion factor is based on the relationship between BTU and kilowatts. It means that 1 BTU per hour is approximately equal to 0.00029307107 kilowatts.",
    "btuToKw": "BTU to KW"
  },
  "percentChange": {
    "title": "Percent Change Calculator",
    "description": "The Percentage Change Calculator will calculate the change from one number to another and express it as an increase or decrease. Example: From 100$ to 200$ is a 100% increase (change), but from 200$ to 100% is 50% decrease.",
    "related": "You may also check "
  },
  "tireSizeCalculator": {
    "title": "Tire Size Calculator",
    "description": "The Tire Size Calculator takes four parameters: width, aspect ratio, and wheel size. The calculator calculates the tire diameter based on these parameters and returns the result. The tire diameter is calculated by adding the tire's width, aspect ratio, and wheel size.",
    "width": "Width",
    "aspectRatio": "Aspect Ratio",
    "wheelDiameter": "Wheel Diameter",
    "diameter": "Inches"
  },
  "percentage": {
    "title": "Percentage Calculator",
    "description": "The Percentage Calculator will find what percent of X is Y.",
    "example": "Example: 1% of 12 is 0.12",
    "valueOne": "%",
    "valueTwo": "Of Number",
    "related": "You may also check "
  },
  "bmi": {
    "title": "Body Mass Index Calculator",
    "description": "BMI is a measurement of a person's leanness or corpulence based on their height and weight, and is intended to quantify tissue mass. It is widely used as a general indicator of whether a person has a healthy body weight for their height.",
    "valueOne": "Weight",
    "valueTwo": "Height"
  },
  "tipCalculator": {
    "title": "Tip Calculator",
    "description": "Here's a simple formula to calculate the tip: Tip amount = Total bill amount * (Tip percentage/100). You can adjust the tip percentage based on your level of satisfaction with the service. Common tip percentages are 15% to 20%.",
    "valueOne": "Bill Amount",
    "valueTwo": "Tip %"
  },
  "cagrCalculator": {
    "title": "CAGR Calculator",
    "description": "A Compound Annual Growth Rate (CAGR) calculator is a tool used to determine the average annual growth rate of an investment over a specific period of time. The CAGR is a useful metric for evaluating the performance of an investment or measuring the growth of a business or financial asset. \n \n To calculate the CAGR, the calculator requires three inputs: \n \n 1. Initial Value: The starting value or investment amount at the beginning of the period. \n 2. Final Value: The ending value or investment amount at the end of the period. \n 3. Number of Years: The duration of the investment or the time period over which the growth occurred. \n \n Using these inputs, the CAGR calculator applies the following formula: \n \n CAGR = ((Final Value / Initial Value) ^ (1 / Number of Years) - 1) * 100 \n \n The formula calculates the growth rate by dividing the final value by the initial value, raising it to the power of the inverse of the number of years, subtracting 1, and then multiplying by 100 to express the result as a percentage.\n \n The CAGR represents the average annual rate at which the investment has grown over the specified period. It provides a standardized way to compare the performance of investments or assets with different time durations or growth patterns. \n \n By using a CAGR calculator, investors, financial analysts, and business professionals can assess the growth potential, evaluate investment returns, and make informed decisions based on the historical growth rates of different assets or investments. \n \n It is important to note that the CAGR assumes a steady growth rate over the entire period, which may not always reflect the actual volatility or fluctuations within the investment's performance. Additionally, the CAGR does not consider any interim variations or compound interest earned during the period, focusing solely on the average annual growth rate.",
    "initialValue": "Initial Investment:",
    "finalValue": "Final value after a certain period:",
    "numYears": "Number of years:"
  },
  "gratuityCalculator": {
    "title": "Gratuity Calculator",
    "description": "Where Total bill amount is the cost of your bill before the tip, and Tip percentage is the percentage of the bill you want to leave as a gratuity. You can adjust the tip percentage based on your level of satisfaction with the service. A common tip range is 15% to 20%.",
    "valueOne": "Total Bill Amount",
    "valueTwo": "Tip Percentage"
  },
  "bounceRateCalculator": {
    "title": "Bounce Rate Calculator",
    "description": "A bounce rate calculator is a tool used to determine the bounce rate of a website or web page. The bounce rate is a metric that measures the percentage of visitors who navigate away from a website or web page after viewing only a single page, without interacting or navigating to any other pages on the site. \n\nTo calculate the bounce rate, the calculator requires two inputs:\n\n1. Total Number of Bounces: The number of visitors who leave the website or page after viewing only a single page.\n2. Total Number of Entrances: The total number of visitors who enter the website or land on the specific page.\n\nUsing these inputs, the bounce rate is calculated using the following formula:\n\nBounce Rate = (Total Number of Bounces / Total Number of Entrances) * 100\n\nThe formula divides the total number of bounces by the total number of entrances and multiplies the result by 100 to express it as a percentage.\n\nThe bounce rate is a critical metric for website owners, marketers, and analysts as it provides insights into visitor engagement and the effectiveness of a website or specific pages. A high bounce rate indicates that a significant portion of visitors leave after viewing only one page, which may suggest issues with content relevancy, user experience, or other factors. Conversely, a lower bounce rate suggests that visitors are exploring further and engaging with the website or page.\n\nBy monitoring and analyzing the bounce rate, website owners can identify areas for improvement and optimize their content, design, and user experience to reduce the bounce rate and increase visitor engagement and conversion rates. A bounce rate calculator simplifies the calculation process, allowing website owners and analysts to measure and track this important metric for their online presence.\n\nUsing a bounce rate calculator, you can quickly determine the bounce rate by providing the total number of bounces and the total number of entrances, helping you make informed decisions and improvements to enhance visitor engagement and overall website performance.",
    "bounces": "Total number of bounces:",
    "entrances": "Total number of entrances:",
    "result": "Bounce Rate: "
  },
  "discountCalculator": {
    "title": "Discount Calculator",
    "description": "A discount calculator is a tool used to calculate the final price of a product after a discount is applied. For example, if the original price of a product is $100 and the discount percentage is 20%, the discounted price would be 100 - (100 * (20/100)) = 80",
    "valueOne": "Original Price",
    "valueTwo": "Discount Percentage"
  },
  "fuelCostCalculator": {
    "title": "Fuel Cost Calculator",
    "description": "A fuel cost calculator is a tool that helps you estimate the cost of fuel for a given distance based on factors such as fuel efficiency and fuel price. It is particularly useful for budgeting and planning purposes, allowing you to determine how much you might need to spend on fuel for a specific trip or commute. \n \n The fuel cost calculator typically takes into account the following inputs: \n 1. Distance: The total distance you will be traveling, usually measured in kilometers or miles. \n 2. Fuel efficiency: The average fuel efficiency of your vehicle, expressed in terms of distance per unit of fuel (such as kilometers per liter or miles per gallon). This value represents how far your vehicle can travel on a given amount of fuel. \n 3. Fuel price: The cost of fuel per unit, usually measured in the currency of your choice (such as dollars, euros, or pounds) per liter or gallon. This value reflects the current price of fuel in your area. \n \n Using these inputs, the calculator performs a simple calculation to estimate the fuel cost. It divides the distance by the fuel efficiency to determine the amount of fuel needed for the trip. Then, it multiplies this value by the fuel price to calculate the total cost. \n \n The result provided by the calculator is an estimate and should be used as a rough guide. Actual fuel consumption and prices may vary depending on various factors such as driving conditions, vehicle maintenance, and fluctuations in fuel prices. \n \n By using a fuel cost calculator, you can plan your travel expenses more effectively, compare different vehicles' fuel efficiencies, and make informed decisions regarding transportation options.",
    "distance": "Distance:",
    "fuelEfficiency": "Fuel Efficiency:",
    "fuelPrice": "Fuel Price:",
    "totalCost": "The trip will cost: "
  },
  "bmr": {
    "title": "Basal Metabolic Rate (BMR) Calculator",
    "description": "The basal metabolic rate (BMR) is the amount of energy needed while resting in a temperate environment when the digestive system is inactive.",
    "age": "Age",
    "male": "Male",
    "female": "Female",
    "weight": "Weight",
    "height": "Height",
    "result": "Calories/day"
  },
  "ageCalc": {
    "title": "Age Calculator",
    "description": "Age calculator helps you to calculate the exact age and how old are you in years, months, weeks, days, hours, minutes, and seconds. Even you can calculate the interval between two dates with this age our age calculator.",
    "years": "Years",
    "valueOne": "Date of Birth:",
    "valueTwo": "Age at Date:",
    "wrongValue": "Age at Date should be greater than Date of Birth."
  },
  "conversionRateCalc": {
    "title": "Conversion Rate Calculator",
    "description": "Conversion rate is a percentage of your site visits or ad viewers which complete the desired target. High conversion rate is crucial to the success of your business and a low conversion rate means your business might be in a trouble. When you have a high conversion rate, it lets you know that you're doing something right with your marketing campaign.",
    "valueOne": "Conversions",
    "valueTwo": "Visits"
  },
  "simpleLoanCalc": {
    "title": "Simple Loan Calculator",
    "description": "Your monthly payment for a loan will depend on the amount, term, and interest rate of the loan. Use the inputs below to get a sense of what your monthly payment could end up being.",
    "loanAmount": "Loan Amount:",
    "loanTerm": "Loan Term:",
    "months": "Months",
    "interestRate": "Interest Rate:",
    "resultMontly": "Total Montly Paid: ",
    "resultTotal": "Total Paid: ",
    "resultTotalInterest": "Total Interest Paid: "
  },
  "profitMarginCalc": {
    "title": "Profit Margin Calculator",
    "description": "The profit margin calculator calculates net profit and profit percentage of sales from the cost and revenue. The net profit margin is net profit divided by revenue.",
    "valueOne": "Const $:",
    "valueTwo": "Revenue $:",
    "netProfitMarginResult": "Net Profit Margin:",
    "netProfitResult": "Net Profit:",
    "profitPercentageResult": "Profit Percentage:",
    "related": "You may also check "
  },
  "marginCalc": {
    "title": "Margin Calculator",
    "description": "The gross margin percentage calculator mark up percentage and gross profit of a sale from the cost and revenue, or selling price, of an item.",
    "valueOne": "Const $:",
    "valueTwo": "Revenue $:",
    "grossMarginResult": "Gross Margin:",
    "markupResult": "Markup:",
    "grossProfitResult": "Gross Profit:",
    "related": "You may also check "
  },
  "dogAgeCalculator": {
    "title": "Dog Age Calculator",
    "description": "Dogs mature more quickly in their first two years of life and then start to slow down. The following formula is commonly used to estimate a dog's age in human years.",
    "age": "Age"
  },
  "sipCalculator": {
    "title": "SIP Calculator",
    "description": "A SIP (Systematic Investment Plan) calculator is a tool used to estimate the future value of an investment made through regular and systematic contributions. It helps individuals plan their investments by calculating the potential returns based on factors such as the initial investment amount, monthly investment amount, interest rate, and investment duration.",
    "initialAmount": "Initial investment amount:",
    "monthlyInvestment": "Monthly investment amount:",
    "annualInterest": "Annual interest rate:",
    "duration": "Investment duration in years:",
    "futureValue": "Future Value: ",
    "totalInvestment": "Total Investment: ",
    "totalReturns": "Total Returns: ",
    "result": "SIP Calculator Result:"
  },
  "catAgeCalculator": {
    "title": "Cat Age Calculator",
    "description": "Cats mature more quickly in their first two years of life and then start to slow down. The following formula is commonly used to estimate a cat's age in human years.",
    "age": "Age:"
  },
  "salaryToHourlyCalculator": {
    "title": "Salary to Hourly Calculator",
    "description": "The calculator calculates the hourly wage equivalent of the given salary, assuming that the employee works 52 weeks a year with 2 weeks of vacation. It returns the hourly wage rounded to two decimal places.",
    "salary": "Year Salary:",
    "hoursPerWeek": "Hours Per Week:",
    "hourlyPay": "Hourly Pay:",
    "perWeek": "Per Week:"
  },
  "loveCalculator": {
    "title": "Love Calculator",
    "description": "A love calculator is a fun and lighthearted tool or application that aims to provide a numerical representation or score indicating the compatibility or strength of a romantic relationship between two individuals. It is often used for amusement or entertainment purposes rather than for serious relationship analysis.",
    "yourName": "Your Name:",
    "yourCrush": "Your Crush:",
    "madeForEachOther": " You are made for each other!",
    "goodChance": " You have a good chance!",
    "sorry": " Not a strong connection, sorry!"
  },
  "compoundInterestCalculator": {
    "title": "Compound Interest Calculator",
    "description": "Compound Interest calculator defines four parameters: \n \n Initial Money - initial amount of money invested \n Interest rate - the annual interest rate (as a percent) \n Years - the number of years the money will be invested \n Compound Per Year - the number of times per year the interest is compounded. \n \n The calculator then calculates the amount of money that will be earned after the given years, taking into account the compound interest rate.",
    "initialMoney": "Initial Money:",
    "interestRate": "Interest Rate:",
    "years": "Years:",
    "compoundPerYear": "Compound Per Year:",
    "futureValue": "Future Value:"
  },
  "cmToFeetConverter": {
    "title": "Cm to Feets Converter",
    "description": "To calculate Cm to Feets you should divide by 2.54 and then divide by 12. Example: 25cm are 0.82 feets.",
    "cmToFeet": "Cm to Feets",
    "feetToCm": "Feets to Cm"
  },
  "mToFeetConverter": {
    "title": "Meters to Feets Converter",
    "description": "To calculate Meters to Feets you should multiply by 3.28. Example: 10m are 32.8 feets.",
    "mToFeet": "M to Feets",
    "feetToM": "Feets to M"
  },
  "cmToInchesConverter": {
    "title": "Cm to Inches Converter",
    "description": "To calculate Cm to Inches you should divide by 2.54 or multiply by 0.3937. Example: 25cm are 9.84 inches.",
    "cmToInch": "Cm to Inches",
    "inchToCm": "Inches to Cm"
  },
  "mmToInchesConverter": {
    "title": "MM to Inches Converter",
    "description": "To calculate Mm to Inches you should divide by 25.4. Example: 250mm are 9.84 inches.",
    "mmToInch": "Mm to Inches",
    "inchToMm": "Inches to Mm"
  },
  "feetToInchesConverter": {
    "title": "Feet to Inches Converter",
    "description": "To calculate Feet to Inches you should multiply by 12. Example: 10 feets are 120 inches.",
    "feetToInch": "Feet to Inches",
    "inchToFeet": "Inches to Feet"
  },
  "milesToKmConverter": {
    "title": "Miles to Km Converter",
    "description": "To calculate Miles to Km you should multiply kilometers by 1.609344. Example: 10 kilometers are ~6.21 miles.",
    "milesToKm": "Miles to Km",
    "kmToMiles": "Km to Miles"
  },
  "randomNumberGenerator": {
    "title": "Random Number Generator",
    "description": "Random Number Generator will generate a random number between Min and Max values.",
    "minValue": "Min Value",
    "maxValue": "Max Value"
  },
  "randomStringGenerator": {
    "title": "Random String Generator",
    "description": "Random String Generator will generate a random string with the picked length and characters to include in it. It could be used to generate unique IDs.",
    "length": "String Length",
    "withNumbers": "Include Numbers",
    "withCapitalLetters": "Include Capital Letters"
  },
  "randomPasswordGenerator": {
    "title": "Random Password Generator",
    "description": "Random Password Generator will generate a random password with the picked length and characters to include in it.",
    "length": "String Length",
    "withNumbers": "Include Numbers",
    "withCapitalLetters": "Include Capital Letters",
    "withSpecialCharacters": "Include Special Characters"
  },
  "randomTeamGenerator": {
    "title": "Random Team Generator",
    "description": "Random Team Generator will generate a random teams with the given names and number of teams.",
    "teamSize": "Number of teams",
    "addTeamMember": "Add Team Member",
    "enterTeamMemberName": "Enter Team Member Name"
  },
  "yesOrNoGenerator": {
    "title": "Yes or No Generator",
    "description": "This generator will help you to get decision by randomly pick Yes or No for you.",
    "button": "Rerun",
    "yes": "Yes",
    "no": "No"
  },
  "randomTextGenerator": {
    "title": "Random Text Generator",
    "description": "The generator uses a loop to generate each word by randomly selecting a character from a list of possible characters (in this case, uppercase and lowercase letters). The maximum word length is 15 characters and the maximum number of words is 1000.",
    "wordLength": "Set words length:",
    "numWords": "Set number of words:"
  },
  "md5Generator": {
    "title": "MD5 Generator",
    "description": "MD5 (Message Digest Algorithm 5) is a widely used cryptographic hash function that produces a 128-bit (16-byte) hash value. It takes an input message of any length and generates a fixed-size hash value, commonly represented as a hexadecimal string. \n \n An MD5 hash is commonly used for various purposes, such as checksumming data integrity, storing passwords securely (though it's no longer recommended), and generating unique identifiers. \n \n To generate an MD5 hash in JavaScript, you can use a library like CryptoJS, which provides a convenient API for cryptographic operations. In the example code provided earlier, we used the CryptoJS library to calculate the MD5 hash of a given input string. \n \n The process involves passing the input message to the MD5 function provided by the library. The function then applies the MD5 algorithm to the input and produces the corresponding hash value. The resulting hash value is typically represented as a hexadecimal string for easy readability. \n \n It's important to note that MD5 is now considered a weak hashing algorithm for cryptographic purposes. It has known vulnerabilities and collisions, which means different input messages can produce the same hash value. Therefore, it is strongly recommended to use stronger and more secure hash functions, such as SHA-256, for cryptographic operations that require stronger data integrity and security.",
    "input": "Enter your text here:"
  },
  "wordCounter": {
    "title": "Word Counter",
    "description": "The counter will count the words from the given text.",
    "text": "Paste your text here:",
    "result": "Words in the text: "
  },
  "mirrorTextGenerator": {
    "title": "Mirror Text Generator",
    "description": "The Mirror Text Generator will generate a mirror variant of your text.",
    "input": "Paste your text here:"
  },
  "bubbleTextGenerator": {
    "title": "Bubble Text Generator",
    "description": "The Bubble Text Generator will generate a bubble variant of your text.",
    "input": "Paste your text here:"
  },
  "zalgoGlitchGenerator": {
    "title": "Zalgo Glitch Text Generator",
    "description": "The Zalgo Glitch Text Generator will generate your text in Zalgo Glitch variant.",
    "input": "Paste your text here:"
  },
  "facebookTextGenerator": {
    "title": "Facebook Font Generator",
    "description": "The Facebook Font Generator will generate your text in a Facebook-like font variant.",
    "input": "Paste your text here:"
  },
  "morseCodeTranslator": {
    "title": "Morse Code Translator",
    "description": "The Morse Code Translator will translate your text in a Morse code variant.",
    "input": "Paste your text here:"
  },
  "binaryCodeTranslator": {
    "title": "Binary Code Translator",
    "description": "The Binary Code Translator will translate your text in a Binary code variant.",
    "input": "Paste your text here:"
  },
  "natoPhoneticAlphabetTranslator": {
    "title": "NATO Phonetical Alphabet Translator",
    "description": "The NATO Phonetical Alphabet Translator will translate your text in a NATO Phonetic Alphabet variant.",
    "input": "Paste your text here:"
  },
  "wattToKilowattConverter": {
    "title": "Watt(W) to Kilowatt(kW) Converter",
    "description": "The watt (W) to kilowatt (kW) converter is a tool used to convert power units from watts to kilowatts. The watt is a unit of power representing the rate at which energy is transferred or used, while the kilowatt is a larger unit equal to 1000 watts.\n\nTo convert watts to kilowatts, you divide the watt value by 1000, as there are 1000 watts in one kilowatt.\n\nFor example, if you have a power value of 5000 watts, you can convert it to kilowatts by dividing 5000 by 1000, resulting in 5 kilowatts.\n\nThe conversion from watts to kilowatts is commonly used when working with larger power values, such as in electrical systems, energy measurements, or utility bills.",
    "input": "Watts:"
  },
  "btuToM2": {
    "title": "BTU to square meter(m2)",
    "description": "The table below will show you how much approximately BTU is needed for cooling and heating as per the square meter(m2) of the room. \n\n Please note that this table provides a rough estimation based on common guidelines and assumptions. The heating or cooling capacity required for a specific area can vary depending on various factors such as insulation, climate, ceiling height, and specific equipment efficiency. It is always recommended to consult with HVAC professionals or refer to equipment specifications for accurate calculations in your specific situation.",
    "area": "Area (m2)",
    "heating": "Heating Capacity (BTU/h)",
    "cooling": "Cooling Capacity (BTU/h)"
  },

  "common": {
    "calculate": "Calculate",
    "check": "Check",
    "generate": "Generate",
    "calculators": "Calculators",
    "calculator": "Calculator",
    "generator": "Generator",
    "generators": "Generators",
    "converters": "Converters",
    "converter": "Converter",
    "convert": "Convert",
    "inches": "Inches",
    "other": "Other",
    "others": "Others",
    "cm": "Cm",
    "m": "M",
    "mm": "Mm",
    "m3": "m3",
    "kw": "KW",
    "kW": "kW",
    "km": "Km",
    "miles": "Miles",
    "feet": "Feet",
    "reset": "Reset",
    "result": "Result:",
    "years": "Years",
    "pageNotFound": "Page Not Found",
    "goBackHome": "Go back home",
    "increase": "Increase",
    "decrease": "Decrease",
    "valueOne": "First Value",
    "valueTwo": "Second Value",
    "search": "Search",
    "copiedToClibboard": "Copied to clibboard",
    "copyToClibboard": "Copy to clibboard",
    "copyright": "© Copyright 2023 WannaCalc. All Rights Reserved.",
    "privacyPolicy": "Privacy Policy",
    "termsOfUse": "Terms of Use",
    "positiveNumbersNote": "Please use only positive values!"
  }
}
